Repository: raywo-personal/teamify
Catalog: src/locale/messages.*.xlf
Languages: de

# ngb.alert.close
source: Close
de: Schließen

# ngb.carousel.previous
source: Previous
de: Vorherige

# ngb.carousel.next
source: Next
de: Nächste

# ngb.datepicker.select-month
source: Select month
de: Wähle Monat

# ngb.datepicker.select-year
source: Select year
de: Wähle Jahr

# ngb.datepicker.previous-month
source: Previous month
de: vorheriger Monat

# ngb.datepicker.next-month
source: Next month
de: nächster Monat

# ngb.timepicker.hours
source: Hours
de: Stunden

# ngb.timepicker.minutes
source: Minutes
de: Minuten

# ngb.timepicker.increment-hours
source: Increment hours
de: erhöhe Stunden

# ngb.timepicker.decrement-hours
source: Decrement hours
de: verringere Stunden

# ngb.timepicker.increment-minutes
source: Increment minutes
de: erhöhe Minuten

# ngb.timepicker.decrement-minutes
source: Decrement minutes
de: verringere Minuten

# ngb.timepicker.seconds
source: Seconds
de: Sekunden

# ngb.timepicker.increment-seconds
source: Increment seconds
de: erhöhe Sekunden

# ngb.timepicker.decrement-seconds
source: Decrement seconds
de: verringere Sekunden

# ngb.timepicker.PM
source: {INTERPOLATION}
de: PM

# ngb.toast.close-aria
source: Close
de: Schließen

# t.madeByMessage
source: Made by raywo with
de: Von raywo mit

# t.timeslots-menu
source: Time slots
de: Zeitfenster

# t.priorKnowledge-menu
source: Prior knowledge
de: Vorkenntnisse

# t.persons-menu
source: Persons
de: Personen

# t.buildTeams-menu
source: Build teams
de: Stelle Teams zusammen

# t.settings-menu
source: Settings
de: Einstellungen

# t.personNameError
source: Please enter a name (2-50 characters).
de: Bitte gib einen Namen ein (2-50 Zeichen lang).

# t.personInformation
source: Information
de: Informationen

# t.personInformationError
source: Please enter information (2-150 characters).
de: Bitte gib Informationen zur Person ein (2-50 Zeichen).

# t.priorKnowledge
source: Prior knowledge
de: Vorkenntnisse

# t.priorKnowledgeExplanation
source: State what prior knowledge the person already has. This will have influence on the creation of groups.
de: Gib an, welche Vorkenntnisse die Person bereits hat. Das wird Einfluss auf die Zuteilung zu Teams haben.

# t.priorKnowledgeEmpty
source: There is no prior knowledge stored yet. Consider adding some by
de: Es sind bisher noch keine Vorkenntnisse erfasst. Ziehe in Betracht, einige hinzuzufügen, indem du

# t.byClickingHere
source: clicking here
de: hier klickst

# t.timeslots
source: Time slots
de: Zeitfenster

# t.timeSlotExplanation1
source: Select the preferred time slots for the person.
de: Wähle die bevorzugten Zeiten der Person aus.

# t.timeSlotExplanation2
source: Place them into the buckets according to the person’s preference. If the person has no specific preference, put the time slots into the first bucket.
de: Ordne die Zeiten den Prioritäten entsprechend der Präferenz der Person zu. Falls die Person gar keine spezifische Präferenz hat, lege die alle Zeiten in die erste Priorität ab.

# t.timeSlotEmpty
source: There is no time slot stored yet. Persons can only be saved if they have a time slot assigned.
de: Du hast noch keine Zeitfenster erfasst. Personen können nur gespeichert sein, wenn sie einem Zeitfenster zugeordnet wurden.

# t.addTimeSlots
source: Add time slots
de: Füge Zeitfenster hinzu

# t.preferredTimeSlots
source: Preferred time slots
de: Bevorzugte Zeitfenster

# t.availableTimeslots
source: Available time slots
de: Verfügbare Zeitfenster

# t.cancel
source: Cancel
de: Abbrechen

# t.save
source: Save
de: Speichern

# t.addNextPerson
source: Add next person
de: Füge nächste Person hinzu

# t.remarkLabel
source: Remark
de: Bemerkung

# t.remarkInvalidFeedback
source: Please enter a remark (2-160 characters).
de: Bitte gib eine Bemerkung ein (2-160 Zeichen).

# t.clear-all-persons
source: Clear all persons
de: Lösche alle Personen

# t.clearAllPersonsConfirmationMessage
source: Are you sure you want to clear all persons?
de: Bist du sicher, dass du alle Personen löschen möchtest?

# t.no-persons-found
source: No persons found
de: keine Personen gefunden

# t.startCreatingPersons
source: Start creating persons by clicking the button below.
de: Füge Personen hinzu, indem du auf den Knopf klickst.

# t.addPerson
source: Add person
de: Füge Person hinzu

# t.priority
source: Priority
de: Priorität

# t.timeSlotEmptyFeedback
source: Please select at least one time slot for this priority.
de: Bitte wähle mindestens ein Zeitfenster aus.

# t.noPreferenceGivenHint
source: No preference given
de: Keine Vorlieben angegeben

# t.noTimeSlotsAssignedTooltip
source: This person has no time slots assigned
de: Dieser Person wurden keine Zeitfenster zugewiesen.

# t.moreActions
source: More actions
de: Mehr

# t.edit
source: Edit
de: Bearbeite

# t.deleteButtonCaption
source: Delete
de: Löschen

# t.deleteHeading
source: Delete
de: Löschen

# t.deleteAreYouSure
source: Are you sure you want to delete this item?
de: Bist du sicher, dass du dieses Element löschen möchtest?

# t.allOptions
source: All
de: Alles

# t.sortBy
source: Sort by
de: Sortieren nach

# t.personSearchPlaceholder
source: Search for a person
de: Suche nach einer Person

# t.xOfYPersons
source: ({{ (this.filteredPersons$ | async)?.length }} of {{ (this.personsCount$ | async) }} persons)
de: ({{ (this.filteredPersons$ | async)?.length }} von {{ (this.personsCount$ | async) }} Personen)

# t.close
source: Close
de: Schließen

# t.deletePerson
source: Delete {{person().name}}
de: Lösche {{person().name}}

# t.deleteConfirmationTitlePerson
source: Delete person
de: Lösche Person

# t.deleteConfirmationMessagePerson
source: Are you sure you want to delete person “{{person().name}}”?
de: Bist du sicher, dass du die Person „{{person().name}}“ löschen möchtest?

# t.priorKnowledgeName
source: Name
de: Bezeichnung

# t.priorKnowledgeNameError
source: Please enter a name (2-50 characters).
de: Bitte gib eine Bezeichnung ein (2-50 Zeichen).

# t.color
source: Color
de: Farbe

# t.toolbarLabelForPriorKnowledgeList
source: Toolbar for working with teams and persons
de: Toolbar für die Arbeit mit Vorkenntnissen

# t.addKnowledgeItem
source: Add knowledge item
de: Füge eine Vorkenntnis hinzu

# t.clearAllPriorKnowledgeCaption
source: Clear all prior knowledge
de: Lösche alle Vorkenntnisse

# t.clearAllPriorKnowledgeConfirmationMessage
source: Are you sure you want to clear all prior knowledge?
de: Bist du sicher, dass du alle Vorkenntnisse löschen möchtest?

# t.noPriorKnowledgeFound
source: No prior knowledge found
de: Keine Vorkenntnisse gefunden.

# t.priorKnowledgeNotAvailableInfoMessage
source: A person's prior knowledge is utilized to achieve a good mix of expertise within the team when assembling teams later.
de: Die Vorkenntnisse einer Person werden bei der Zusammenstellung von Teams berücksichtigt, um eine gute Mischung der Kenntnisse im Team zu erreichen.

# t.startCreatingPriorKnowledge
source: Begin creating prior knowledge by using the button below.
de: Erstelle Vorkenntnisse, indem du den Knopf unten benutzt.

# t.addPriorKnowledgeCaption
source: Add prior knowledge
de: Füge eine Vorkenntnis hinzu

# t.deleteKnowledge
source: Delete {{knowledge().name}}
de: Lösche {{knowledge().name}}

# t.deleteConfirmationTitleKnowledge
source: Delete knowledge item
de: Lösche Vorkenntnis

# t.deleteConfirmationMessageKnowledge
source: Are you sure you want to delete knowledge item “{{knowledge().name}}”?
de: Bist du sicher, dass du die Vorkenntnis „{{knowledge().name}}“ löschen möchtest?

# t.cancelButtonCaption
source: Cancel
de: Abbrechen

# t.priorKnowledgeDescription
source: Description
de: Beschreibung

# t.priorKnowledgeDescriptionError
source: Please enter a description (2-160 characters).
de: Bitte gib eine Beschreibung ein (2-160 Zeichen).

# t.exportDataHeading
source: <i class="bi-download me-3"></i>Export data
de: <i class="bi-download me-3"></i>Datenexport

# t.whatToExport
source: What data do you want to export?
de: Was möchtest du exportieren?

# t.exportDataNote
source: Please keep in mind when exporting persons, no associations to time slots, prior knowledge or teams will be exported. Only names (and IDs) are exported. If you need to be able to restore all associations, please use “All data” instead.
de: Bitte beachte, dass beim Export von Personen keine Informationen über Zeitfenster und Vorkenntnisse mitexportiert werden. Nur die Namen (und ggf. IDs) werden exportiert. Wenn du alle Informationen exportieren möchtest, nutze bitte die Funktion „Alle Daten“.

# t.allDataCaption
source: All data
de: Alle Daten

# t.timeSlotDataCaption
source: Time slot data
de: Zeitfenster

# t.priorKnowledgeDataCaption
source: Prior knowledge data
de: Vorkenntnisse

# t.personDataCaption
source: Person data
de: Personen

# t.exportPersonDataForTeam
source: Export persons in team:
de: Exportiere Personen des Teams:

# t.importDataHeading
source: <i class="bi-upload me-3"></i>Import data
de: <i class="bi-upload me-3"></i>Datenimport

# t.whatToImport
source: What data do you want to import?
de: Was möchtest du importieren?

# t.importDataNote
source: When importing persons, please note that associations with time slots, prior knowledge, or teams will not be included. Only names (and IDs) will be imported. To restore all associations, consider using the “All data” option instead.
de: Wenn du Personen importierst, werden Verknüpfungen zu Zeitfenstern, Vorkenntnissen und Teams nicht mit importiert. Nur Namen (und ggf. IDs) werden importiert. Wenn du alle Informationen wiederherstellen willst, benutze bitte die Option „Alle Daten“.

# t.importDataFileFormatNote
source: Files must be in JSON format, previously exported from the application. Alternatively, you can import names using a text file, with each name on a separate line.
de: Dateien müssen im JSON-Format vorliegen und zuvor aus der Anwendung exportiert worden sein. Alternativ kannst du Namen mithilfe einer Textdatei importieren, wobei jeder Name in einer separaten Zeile stehen muss.

# t.importDataWarning
source: <strong class="text-danger">Note:</strong> Importing data will overwrite existing data.
de: <strong class="text-danger">Achtung:</strong> Ein Datenimport überschreibt alle vorhandenen Daten!

# t.dropFileHere
source: <strong>Drop a file</strong><br> or click below to browse for a file.
de: <strong>Ziehe eine Datei hierher</strong><br> oder klicke, um eine Datei auszuwählen.

# t.dropFileError
source: Only a single JSON or txt file is supported.
de: Du kannst nur eine einzelne JSON- oder Text-Datei importieren.

# t.chooseFile
source: Choose a file to upload
de: Wähle eine Datei zum Hochladen aus.

# t.previewHeading
source: Preview
de: Vorschau

# t.invalidJSONError
source: <strong>Invalid JSON file</strong><br> Please check the file and try again.
de: <strong>Ungültige JSON-Datei</strong><br> Bitte prüfe die Datei und versuche es erneut.

# t.invalidFormatError
source: <strong>Wrong format</strong><br> Please check the file and try again.
de: <strong>Falsches Format</strong><br> Bitte prüfe die Datei und versuche es erneut.

# t.importComplete
source: <strong>Import complete</strong><br> The data has been imported successfully.
de: <strong>Import vollständig</strong><br> Die Daten wurden erfolgreich importiert.

# t.timeSlotPreviewPretext
source: The following time slots will be imported:
de: Die folgenden Zeitfenster werden importiert:

# t.priorKnowledgePreviewPretext
source: The following prior knowledge will be imported:
de: Die folgenden Vorkenntnisse werden importiert:

# t.personPreviewPretext
source: The following persons will be imported:
de: Die folgenden Personen werden importiert:

# t.teamPreviewPretext
source: The following complete set will be imported:
de: Die folgenden vollständigen Daten werden importiert:

# t.clearDataCaption
source: Clear data
de: Zurücksetzen

# t.importDataCaption
source: Import data
de: Importiere Daten

# t.nothingToImport
source: Nothing to import here.
de: Nichts zu importieren.

# t.languageHeading
source: <i class="bi-translate"></i> Language
de: <i class="bi-translate"></i> Sprache
